#!/usr/bin/env python3

"""
Lecture 2 - Exercise 5
Вие сте създател на популярен сайт за запознанства и
искате да улесните вашите потребители да намерят своята половинка.
За целта вие събирате информация за интересите на всеки потребител и
се опитвате да намерите партньор с максимално общи интереси.
Имате дадени два списъка които съдържат интересите на Иванчо и Марийка.
Напишете код който показва само общите интереси между двамата.

ivan = ['пушене', 'пиене', 'тия три неща', 'коли', 'facebook', 'игри', 'разходки по плажа', 'скандинавска поезия']
maria = ['пиене', 'мода', 'facebook', 'игри', 'лов със соколи', 'шопинг', 'кино']

Date: 20160113
Version: 0.1
"""

ivan = ['пушене', 'пиене', 'тия три неща', 'коли', 'facebook', 'игри', 'разходки по плажа', 'скандинавска поезия']
maria = ['пиене', 'мода', 'facebook', 'игри', 'лов със соколи', 'шопинг', 'кино']

common_interests = set(ivan).intersection(set(maria))
# print(common_interests)

print("Общи интереси на Иван и Мария: ",   end='')
for idx, value in enumerate(common_interests):
    if idx == len(common_interests) - 1:
        print(value)
    else:
        print(value + ', ', end='')


